{
    "grader": {
        "title": "Computer Science Grader",
        "subtitle": "Penn State University | January 2024 - Present",
        "body": "Analyze students’ code for correctness and quality, requiring a deep understanding of code and coding practices. Locate errors in students’ programs based on test results, showcasing strong debugging and development skills. Practice technical communication by providing valuable feedback to students to help them improve coding skills. Leverage collaboration skills when discussing submissions with the grading team to ensure fair scores."
    },
    "dominos": {
        "title": "Delivery Driver",
        "subtitle": "Domino's Pizza | September 2023 - January 2024",
        "body": "Consistently met deadlines, showcasing strong time-management skills crucial for tech project timelines. Ensured precision in tasks, reflecting a dedication to quality, vital for coding and software debugging. Adapted effectively to diverse scenarios, honing valuable problem-solving abilities for tech challenges. Communicated clearly and amiably, facilitating collaboration with cross-functional tech teams. Efficiently planned routes and multitasked under pressure, demonstrating effective time management."
    },
    "sjp": {
        "title": "HS Data Analytics Competition - Second Place",
        "subtitle": "St. Joseph's University | March 2022",
        "body": "Developed a comprehensive presentation addressing modern statistical challenges in the realm of blockchain technology. Exemplified strong teamwork and coordination within my team for a second-round presentation under tight time constraints. Exhibited exceptional presentation skills, effectively communicating innovative ideas to the judging panel."
    },
    "ihb": {
        "title": "Server's Assistant",
        "subtitle": "Iron Hill Brewery | May 2021 - August 2022",
        "body": "Ensured accurate and timely food deliveries, accommodating special requests for enhanced customer satisfaction. Demonstrated effective communication skills with customers and colleagues, facilitating collaborative problem-solving. Collaborated seamlessly with the serving team, optimizing tasks such as plate clearing, refills, and customer inquiries. Maintained restaurant cleanliness and organization by consistently attending to tables, floors, and supplies."
    },
    "counselor": {
        "title": "Camp Counselor",
        "subtitle": "St. Thomas Outreach Camp | June 2016 - June 2019",
        "body": "Supervised groups of up to 10 underprivileged children living in shelters in Philadelphia, showcasing leadership and organization. Orchestrated diverse camp activities, highlighting creativity and adaptability. Enforced rules while maintaining a fun atmosphere, ensuring a structured and orderly environment and demonstrating communication abilities. Fostered inclusivity and teamwork in the camp environment."
    }
}